applications/Bioconversion/models/bioreactor/bubble_column/TEMPLATE/system/blockMeshDict
//--------------------------------*- C++ -*----------------------------------
// blockMesh :  Block mesh description file
//
// adapted from:
// http://www.cfd-online.com/Forums/openfoam-meshing-blockmesh/61796-help-could-anyone-post-simple-cylinder-mesh.html
//
// JJS, 1/8/16
//
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
  version  2.0;
  format   ascii;
  class dictionary;
  object blockMeshDict;
}
// ************************************






   convertToMeters 1;

      // outer cylinder diameter
     // outer cylinder length
      //  inner cylinder diameter
   
   
   
   
   
    //Width of middle square section
   
   
   

   
   

    //how many cells in the square section
    //how many cells from square section to perimeter
    // how many cells from top to bottom

   vertices
   (
    //Bottom surface
    //==========

    //square
    ( ##VARIABLE_SQUARE## 0.0  ##VARIABLE_SQUARE##) // Vertex fiveoclock_sq1 = 0 
    (-##VARIABLE_SQUARE## 0.0  ##VARIABLE_SQUARE##) // Vertex sevenoclock_sq1 = 1 
    (-##VARIABLE_SQUARE## 0.0 -##VARIABLE_SQUARE##) // Vertex elevenoclock_sq1 = 2 
    ( ##VARIABLE_SQUARE## 0.0 -##VARIABLE_SQUARE##) // Vertex oneoclock_sq1 = 3 

    //outer circle
    ( ##VARIABLE_OUTER_COLUMN_RADIUS## 0.0  ##VARIABLE_OUTER_COLUMN_RADIUS##) // Vertex fiveoclock_c11 = 4 
    (-##VARIABLE_OUTER_COLUMN_RADIUS## 0.0  ##VARIABLE_OUTER_COLUMN_RADIUS##) // Vertex sevenoclock_c11 = 5 
    (-##VARIABLE_OUTER_COLUMN_RADIUS## 0.0 -##VARIABLE_OUTER_COLUMN_RADIUS##) // Vertex elevenoclock_c11 = 6 
    ( ##VARIABLE_OUTER_COLUMN_RADIUS## 0.0 -##VARIABLE_OUTER_COLUMN_RADIUS##) // Vertex oneoclock_c11 = 7 

    //inner circle
    ( ##VARIABLE_INNER_COLUMN_RADIUS## 0.0  ##VARIABLE_INNER_COLUMN_RADIUS##) // Vertex fiveoclock_c21 = 8 
    (-##VARIABLE_INNER_COLUMN_RADIUS## 0.0  ##VARIABLE_INNER_COLUMN_RADIUS##) // Vertex sevenoclock_c21 = 9 
    (-##VARIABLE_INNER_COLUMN_RADIUS## 0.0 -##VARIABLE_INNER_COLUMN_RADIUS##) // Vertex elevenoclock_c21 = 10 
    ( ##VARIABLE_INNER_COLUMN_RADIUS## 0.0 -##VARIABLE_INNER_COLUMN_RADIUS##) // Vertex oneoclock_c21 = 11 
   

    //Top surface

    //square
    ( ##VARIABLE_SQUARE## ##VARIABLE_COLUMN_HEIGHT##  ##VARIABLE_SQUARE##) // Vertex fiveoclock_sq2 = 12 
    (-##VARIABLE_SQUARE## ##VARIABLE_COLUMN_HEIGHT##  ##VARIABLE_SQUARE##) // Vertex sevenoclock_sq2 = 13 
    (-##VARIABLE_SQUARE## ##VARIABLE_COLUMN_HEIGHT## -##VARIABLE_SQUARE##) // Vertex elevenoclock_sq2 = 14 
    ( ##VARIABLE_SQUARE## ##VARIABLE_COLUMN_HEIGHT## -##VARIABLE_SQUARE##) // Vertex oneoclock_sq2 = 15 

    //outer circle
    ( ##VARIABLE_OUTER_COLUMN_RADIUS## ##VARIABLE_COLUMN_HEIGHT##  ##VARIABLE_OUTER_COLUMN_RADIUS##) // Vertex fiveoclock_c12 = 16 
    (-##VARIABLE_OUTER_COLUMN_RADIUS## ##VARIABLE_COLUMN_HEIGHT##  ##VARIABLE_OUTER_COLUMN_RADIUS##) // Vertex sevenoclock_c12 = 17 
    (-##VARIABLE_OUTER_COLUMN_RADIUS## ##VARIABLE_COLUMN_HEIGHT## -##VARIABLE_OUTER_COLUMN_RADIUS##) // Vertex elevenoclock_c12 = 18 
    ( ##VARIABLE_OUTER_COLUMN_RADIUS## ##VARIABLE_COLUMN_HEIGHT## -##VARIABLE_OUTER_COLUMN_RADIUS##) // Vertex oneoclock_c12 = 19 

    //inner circle
    ( ##VARIABLE_INNER_COLUMN_RADIUS## ##VARIABLE_COLUMN_HEIGHT##  ##VARIABLE_INNER_COLUMN_RADIUS##) // Vertex fiveoclock_c22 = 20 
    (-##VARIABLE_INNER_COLUMN_RADIUS## ##VARIABLE_COLUMN_HEIGHT##  ##VARIABLE_INNER_COLUMN_RADIUS##) // Vertex sevenoclock_c22 = 21 
    (-##VARIABLE_INNER_COLUMN_RADIUS## ##VARIABLE_COLUMN_HEIGHT## -##VARIABLE_INNER_COLUMN_RADIUS##) // Vertex elevenoclock_c22 = 22 
    ( ##VARIABLE_INNER_COLUMN_RADIUS## ##VARIABLE_COLUMN_HEIGHT## -##VARIABLE_INNER_COLUMN_RADIUS##) // Vertex oneoclock_c22 = 23 

   );				

   blocks
   (
    //square block
    hex (
       1 0 3 2
       13 12 15 14
       )
    (8 8 200)
    simpleGrading (1 1 1)

    //slice1
    hex (
       9 8 0 1
       21 20 12 13
       )
    (8 8 200)
    simpleGrading (1 1 1)

    //slice2
    hex (
       10 9 1 2
       22 21 13 14
       )
   (8 8 200)
simpleGrading (1 1 1)

   //slice3
   hex (
         11 10 2 3
         23 22 14 15
       )
   (8 8 200)
simpleGrading (1 1 1)

   //slice4
   hex (
         8 11 3 0
         20 23 15 12
       )
   (8 8  200)
   simpleGrading (1 1 1)

    //slice1
    hex (
       4 8 9 5
       16 20 21 17
       )
    (8 8 200)
    simpleGrading (1 1 1)

    //slice2
    hex (
       5 9 10 6
       17 21 22 18
       )
   (8 8 200)
simpleGrading (1 1 1)

   //slice3
   hex (
       6 10 11  7
       18 22 23  19
       )
   (8 8 200)
simpleGrading (1 1 1)

   //slice4
   hex (
       7 11 8  4
       19 23 20  16
       )
   (8 8  200)
   simpleGrading (1 1 1)
    
   );


   //create the quarter circles
   edges
   (
    arc 4 5   (0.0 0.0 ##VARIABLE_OUTER_COLUMN_RADIUS##)
    arc 5 6 (-##VARIABLE_OUTER_COLUMN_RADIUS## 0.0 0.0)
    arc 6 7   (0.0 0.0 -##VARIABLE_OUTER_COLUMN_RADIUS##)
    arc 7 4     (##VARIABLE_OUTER_COLUMN_RADIUS## 0.0 0.0)

    arc 16 17   (0.0 ##VARIABLE_COLUMN_HEIGHT## ##VARIABLE_OUTER_COLUMN_RADIUS##)
    arc 17 18 (-##VARIABLE_OUTER_COLUMN_RADIUS## ##VARIABLE_COLUMN_HEIGHT## 0.0)
    arc 18 19   (0.0 ##VARIABLE_COLUMN_HEIGHT## -##VARIABLE_OUTER_COLUMN_RADIUS##)
    arc 19 16     (##VARIABLE_OUTER_COLUMN_RADIUS##  ##VARIABLE_COLUMN_HEIGHT## 0.0)
    
    arc 8 9   (0.0 0.0 ##VARIABLE_INNER_COLUMN_RADIUS##)
    arc 9 10 (-##VARIABLE_INNER_COLUMN_RADIUS## 0.0 0.0)
    arc 10 11   (0.0 0.0 -##VARIABLE_INNER_COLUMN_RADIUS##)
    arc 11 8     (##VARIABLE_INNER_COLUMN_RADIUS## 0.0 0.0)

    arc 20 21   (0.0 ##VARIABLE_COLUMN_HEIGHT## ##VARIABLE_INNER_COLUMN_RADIUS##)
    arc 21 22 (-##VARIABLE_INNER_COLUMN_RADIUS## ##VARIABLE_COLUMN_HEIGHT## 0.0)
    arc 22 23   (0.0 ##VARIABLE_COLUMN_HEIGHT## -##VARIABLE_INNER_COLUMN_RADIUS##)
    arc 23 20     (##VARIABLE_INNER_COLUMN_RADIUS##  ##VARIABLE_COLUMN_HEIGHT## 0.0)
   );

   patches
   (
    patch inlet
    (
     (0 3 2 1)
     (0 8 9 1)
     (1 9 10 2)
     (2 10 11 3)
     (3 11 8 0)
    )

    patch outlet
    (
     (12 15 14 13)
     (12 20 21 13)
     (13 21 22 14)
     (14 22 23 15)
     (15 23 20 12)

     (20 16 17 21)
     (21 17 18 22)
     (22 18 19 23)
     (23 19 16 20)

    )

    wall walls
    (
     (8 4 5 9)
     (9 5 6 10)
     (10 6 7 11)
     (11 7 4 8)
     
     (4 16 17 5)
     (5 17 18 6)
     (6 18 19 7)
     (7 19 16 4)
    )

);

mergePatchPairs
(
);
